package seminar_6.task_1;

/*
1. Напишите метод, который заполнит массив из 1000 элементов случайными цифрами от 0 до 24.
2. Создайте метод, в который передайте заполненный выше массив и с помощью Set вычислите процент
уникальных значений в данном массиве и верните его в виде числа с плавающей запятой.
Для вычисления процента используйте формулу:
процент уникальных чисел = количество уникальных чисел * 100 / общее количество чисел в массиве.
*/

import java.util.Set;

public class MyProgram {
    public void run() {

    }

    public static void main(String[] args) {
        MyProgram program = new MyProgram();
        program.run();
    }
}