/* Задача №3
 * ==========================================================================================================
 * Напишите программу, которая принимает с консоли число в формате byte и записывает его в файл ”result.txt”.
 * Требуется перехватить все возможные ошибки и вывести их в логгер.
 * После написания, попробуйте подать на вход числа 100 и 200 и проследите разницу в результате
 * ==========================================================================================================
 */

package homework_2.task_3;

public class MyProgram {
    public static void main(String[] args) {

    }
}