/* Задача №5
 * ==========================================================================================================
 * К калькулятору из предыдущего дз добавить логирование.
 * ==========================================================================================================
 */

package homework_2.task_5;

public class MyProgram {
    public void run() {
        
    }

    public static void main(String[] args) {
        MyProgram program = new MyProgram();
        program.run();
    }
}