/* Задача №1
 * =================================================================================
 * Вам дается строка S и целочисленный массив индексов int index[s.length].
 * Напишите программу, которая перетасует символы в S таким образом,
 * что символ c i-й позиции переместится на индекс index[i] в результирующей строке.
 * Пример: s = “cba”, index = [3,2,1] result “abc”
 * =================================================================================
 */

package homework_2.task_1;

public class MyProgram {
    public static void main(String[] args) {
        
    }
}