/*
Задача №2
=================================================================================================
Пусть дан список сотрудников: Иван Иванов, Светлана Петрова, Кристина Белова, Анна Мусина,
Анна Крутова, Иван Юрин,Петр Лыков, Павел Чернов, Петр Чернышов, Мария Федорова, Марина Светлова,
Мария Савина, Мария Рыкова, Марина Лугова, Анна Владимирова, Иван Мечников, Петр Петин, Иван Ежов.
Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений.
Отсортировать по убыванию популярности. Для сортировки использовать TreeMap.
=================================================================================================
*/

package homework_5.task_2;

public class MyProgram {
    public void run() {

    }

    public static void main(String[] args) {
        MyProgram program = new MyProgram();
        program.run();
    }
}