/*
Задача №3
=====================================================================================
Заполнить список названиями планет Солнечной системы в произвольном порядке
с повторениями. Вывести название каждой планеты и количество его повторений в списке.
=====================================================================================
*/

package homework_3.task_3;

public class MyProgram {
    public void run() {

    }

    public static void main(String[] args) {
        MyProgram program = new MyProgram();
        program.run();
    }
}